app/controllers/home_controller.rb

  def send_text
    TextMessage.create(:message => params[:message], :number => params[:number])
---
INSERT INTO "text_messages" ("message", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "this is a test"], ["number", "9803338415"], ["created_at", "2016-04-05 18:18:47.783365"], ["updated_at", "2016-04-05 18:18:47.783365"]]