app/controllers/text_messages_controller.rb

  def index
    @text_messages = TextMessage.all
---
SELECT "text_messages".* FROM "text_messages"